import React from 'react'
import { useState }  from 'react'
import './Index.css'
import Btn from '../../assest/Btn/Btn'
import Levinteam from '../../assest/Neon/Levinteam'
import PoPup from '../../assest/PoPup/PoPup'
import scrollTop from '../../utils';
import { Helmet } from "react-helmet";


export default function Index() {

  // Smart Management Text Box =>

    const smTextBox = [
      {id:1 , src: "Images/Icon/Checkbox-Done.svg" , text: "افزایش فروش و بهره‌وری"} ,
      {id:2 , src: "Images/Icon/Checkbox-Done.svg" , text: "سیستم نوبت‌دهی آنلاین یکپارچه"} ,
      {id:3 , src: "Images/Icon/Checkbox-Done.svg" , text: "ایجاد گالری اختصاصی برای نمایش محصولات"} ,
      {id:4 , src: "Images/Icon/Checkbox-Done.svg" , text: "پرداخت‌های امن و مطمئن"} ,
      {id:5 , src: "Images/Icon/Checkbox-Done.svg" , text: "مدیریت ساده و کاربرپسند"} ,
      {id:6 , src: "Images/Icon/Checkbox-Done.svg" , text: "طراحی اختصاصی و متناسب با نیازهای شما"} ,
    ]

    // Card List =>

    const cardData = [
      { id: 1, src: '#' , name: ' فرانت اند ', description: 'طراحی رابط کاربری مدرن و واکنش‌گرا برای تجربه‌ای جذاب.' },
      { id: 2, src: '#' , name: ' بک اند ', description: 'پیاده‌سازی منطق قدرتمند و امن برای پشت‌صحنه اپلیکیشن‌ها.' },
      { id: 3, src: '#' , name: ' سئو ', description: 'بهینه‌سازی سایت برای بهبود رتبه در موتورهای جستجو.' },
      { id: 4, src: '#' , name: ' دیزاین ', description: 'خلق طراحی‌های گرافیکی منحصربه‌فرد و کاربرپسند.' },
      { id: 5, src: '#' , name: ' ربات تلگرام ', description: 'توسعه ربات‌های تلگرام برای خدمات خودکار و سریع.' },
      { id: 6, src: '#' , name: ' ربات دیسکورد ', description: 'ساخت ربات‌های دیسکورد برای بهبود مدیریت و تعامل.' },
      { id: 7, src: '#' , name: ' امنیت ', description: 'افزایش امنیت با شناسایی و رفع آسیب‌پذیری‌ها.' },
      { id: 8, src: '#' , name: ' ریدیزاین ', description: 'بازطراحی مدرن برای بهبود تجربه کاربری و برند.' }
    ];

      const [showModal, setShowModal] = useState(false);
      const [foundData, setFoundData] = useState(null);
    
      const toggleModal = (event) => {
        setShowModal(!showModal);
        if (!showModal) {
          document.body.classList.add('modal-open');
    
          const modalTarget = parseInt(event.currentTarget.value, 10);
          const services = [
            {
                id: 1,
                title: 'فرانت اند',
                paragraph: 'ما با بهره‌گیری از جدیدترین تکنولوژی‌ها نظیر React، Bootstrap، Tailwind و وانیلا جاوااسکریپت، رابط‌های کاربری منحصر به فرد، واکنش‌گرا و کاربرپسند ایجاد می‌کنیم. هدف ما فراهم آوردن تجربه‌ای بی‌نقص، لذت‌بخش و بهینه برای کاربران شما است. با تمرکز بر بهینه‌سازی سرعت بارگذاری و سازگاری با مرورگرهای مختلف، مطمئن می‌شویم که وبسایت شما همواره بهترین عملکرد را ارائه می‌دهد. به علاوه، استفاده از تکنیک‌های پیشرفته در طراحی فرانت اند، ما را قادر می‌سازد تا وبسایت‌هایی با قابلیت دسترسی بالا و تجربه کاربری متناسب با نیازهای کاربران شما ایجاد کنیم.'
            },
            {
                id: 2,
                title: 'بک اند',
                paragraph: 'ما با بهره‌مندی از دانش عمیق در Django، Node.js، Express و دیتابیس‌های MySQL و MongoDB، زیرساخت‌های قوی، امن و مقیاس‌پذیر را برای پروژه‌های شما طراحی و پیاده‌سازی می‌کنیم. هدف اصلی ما ارائه خدمات با کارایی و امنیت بالا است تا بتوانید با خیالی آسوده به توسعه کسب و کار خود بپردازید. با تمرکز بر بهینه‌سازی عملکرد سرور و استفاده از تکنیک‌های مدرن در مدیریت داده‌ها، ما به شما کمک می‌کنیم تا پروژه‌هایی با عملکرد سریع و قابلیت مقیاس‌پذیری بالا راه‌اندازی کنید. همچنین، ما به امنیت داده‌ها و پایداری سرورها توجه ویژه‌ای داریم تا سیستم‌های شما در برابر تهدیدات مختلف مقاوم باشند.'
            },
            {
                id: 3,
                title: 'سئو',
                paragraph: 'ما با استفاده از تکنیک‌های پیشرفته سئو و بهینه‌سازی موتورهای جستجو، رتبه وبسایت شما را در صفحات نتایج جستجوی گوگل و سایر موتورهای جستجو بهبود می‌بخشیم. از تحقیق کلمات کلیدی گرفته تا بهینه‌سازی محتوا، ساختار صفحات و ایجاد لینک‌های خارجی با کیفیت، تمامی جوانب سئو را پوشش می‌دهیم. هدف ما افزایش ترافیک ارگانیک وبسایت شما و بهبود نرخ تبدیل بازدیدکنندگان به مشتریان است. با استفاده از تحلیل‌های دقیق و پیاده‌سازی استراتژی‌های هدفمند، وبسایت شما را به رقبای اصلی در حوزه کسب و کار خود تبدیل می‌کنیم.'
            },
            {
                id: 4,
                title: 'دیزاین',
                paragraph: 'ما با ایجاد طراحی‌های گرافیکی جذاب، منحصر به فرد و کاربرپسند، وبسایت‌هایی خلق می‌کنیم که نه تنها زیبا هستند بلکه به بهبود تعامل کاربران نیز کمک می‌کنند. طراحی‌های ما بر اساس اصول تجربه کاربری (UX) و رابط کاربری (UI) شکل می‌گیرد تا بتواند نیازهای کاربران را به بهترین شکل پاسخ دهد. با ترکیب هنر و تکنولوژی، ما به شما کمک می‌کنیم تا وبسایتی بسازید که به راحتی بازدیدکنندگان را جذب کرده و آنها را به مشتریان وفادار تبدیل کند. طراحی ما همچنین بهینه‌سازی شده برای موتورهای جستجو است، به طوری که ظاهر جذاب سایت شما در کنار محتوای با کیفیت به افزایش ترافیک و رتبه سئو کمک می‌کند.'
            },
            {
                id: 5,
                title: 'ربات تلگرام',
                paragraph: 'ما ربات‌های تلگرامی هوشمند و کارآمد را با استفاده از تکنولوژی‌های پیشرفته‌ای نظیر Node.js و جاوااسکریپت توسعه می‌دهیم که می‌توانند به صورت خودکار و سریع وظایف مختلفی را انجام دهند. این ربات‌ها می‌توانند به عنوان دستیارهای دیجیتال عمل کنند و خدمات متنوعی از جمله ارسال اعلان‌ها، پاسخ به سوالات کاربران، مدیریت محتوا و حتی اجرای فرآیندهای پیچیده را برای شما فراهم آورند. با توجه به نیازهای شما، ما ربات‌های شخصی‌سازی شده‌ای طراحی می‌کنیم که به بهبود تجربه کاربری و افزایش بهره‌وری کسب و کار شما کمک می‌کنند.'
            },
            {
                id: 6,
                title: 'ربات دیسکورد',
                paragraph: 'ما ربات‌های دیسکورد پیشرفته‌ای را برای بهبود مدیریت و تعامل در سرورهای آنلاین طراحی و توسعه می‌دهیم. این ربات‌ها می‌توانند وظایف مدیریتی مانند مدیریت کاربران، تنظیم نقش‌ها، ارسال اعلان‌ها و حتی اجرای بازی‌ها و تعاملات پویا با اعضا را به صورت خودکار انجام دهند. با استفاده از تکنولوژی‌های روز، ربات‌هایی کارآمد و انعطاف‌پذیر می‌سازیم که به شما کمک می‌کنند تا سرورهای خود را بهبود داده و تجربه‌ای بهینه برای کاربران خود ایجاد کنید. این ربات‌ها به گونه‌ای طراحی شده‌اند که به راحتی قابل تنظیم و گسترش باشند و بتوانند با نیازهای رو به رشد سرور شما هماهنگ شوند.'
            },
            {
                id: 7,
                title: 'امنیت',
                paragraph: 'ما با شناسایی و رفع آسیب‌پذیری‌ها و استفاده از جدیدترین روش‌ها و ابزارهای امنیتی، امنیت وبسایت و اپلیکیشن‌های شما را به حداکثر می‌رسانیم. خدمات امنیتی ما شامل تست نفوذ، ارزیابی آسیب‌پذیری، رمزنگاری داده‌ها و پیاده‌سازی فایروال‌ها است تا از سیستم‌های شما در برابر تهدیدات مختلف محافظت شود. همچنین، با ارائه راهکارهای امنیتی پیشگیرانه، از بروز حملات و نفوذهای احتمالی جلوگیری می‌کنیم. هدف ما اطمینان از این است که داده‌های شما همیشه ایمن بوده و وبسایت شما در برابر حملات سایبری مقاوم باشد.'
            },
            {
                id: 8,
                title: 'ریدیزاین',
                paragraph: 'ما وبسایت شما را با رویکردی مدرن، خلاقانه و متناسب با ترندهای جدید و نیازهای کاربران بازطراحی می‌کنیم. بازطراحی ما شامل بهبود ظاهر گرافیکی، ارتقاء تجربه کاربری و بهینه‌سازی ساختار فنی وبسایت است. هدف ما افزایش نرخ تبدیل و جذب بیشتر کاربران است، به گونه‌ای که وبسایت شما نه تنها زیبا بلکه کارآمد و موثر نیز باشد. با بهینه‌سازی سرعت بارگذاری صفحات و بهبود ساختار سئو، مطمئن می‌شویم که وبسایت شما در نتایج جستجوی گوگل رتبه بالاتری کسب کرده و تجربه کاربری بهتری ارائه دهد.'
            }
        ];
    
          const found = services.find(modalData => modalData.id === modalTarget);
          setFoundData(found);
          console.log(foundData);
          
        } else {
          document.body.classList.remove('modal-open');
        }
      };

    // Roadmap Carts =>

      const roadmap = [
        {id: 1 ,title: 'طراحی پرتوتایپ', content: 'نینجاهای ما با هنرهای خود ، پروتوتایپ اولیه را طراحی می‌کنند تا مسیر پروژه مشخص شود. این سلاح نینجاهاست.'},
        {id: 2 ,title: ' بازبینی و تایید ', content: 'پروتوتایپ را به کارفرما ارائه داده و با دقت، نظرات نهایی را برای ادامه مسیر دریافت می‌کنیم.',},
        {id: 3 ,title: 'تلفیق و توسعه', content: 'نینجاهای ما با استفاده از تکنیک‌های پیشرفته، نیروهای فرانت‌اند، بک‌اند و هر ابزار لازم را به‌کار می‌گیرند.',},
        {id: 4 ,title: ' توسعه و یکپارچگی' ,content: 'با استفاده از هنرهای مخفی، بخش‌های بک‌اند و سرور را به هم پیوند می‌دهیم تا سایت با نهایت سرعت و امنیت راه‌اندازی شود.'},
        {id: 5 , title: 'تست نهایی' ,content: 'قبل از تحویل نهایی، نینجاها سایت را تست کرده و هر نقصی را از بین می‌برند تا عملکردی بی‌نقص داشته باشد.'},
        {id: 6 , title: 'راه‌اندازی و پشتیبانی' , content: 'پس از تحویل سایت، نینجاها همواره در کمین‌اند تا هر مشکلی را سریعاً برطرف کنند و امنیت سایت را تضمین کنند.'},
      ]

  return (
    <>
      <Helmet>
      <title>شرکت لوین | طراحی وب‌سایت، سئو و امنیت و طراحی ربات های تلگرام و دیسکورد</title>
            <meta name="description" content="شرکت لوین ارائه دهنده خدمات طراحی و توسعه وب‌سایت، سئو، امنیت و طراحی ربات‌های تلگرام و دیسکورد. با تیم حرفه‌ای ما وب‌سایت خود را به سطح بالاتری ببرید."></meta>
            <meta name="keywords" content="طراحی وب‌سایت, توسعه وب, سئو, امنیت وب‌سایت, ربات تلگرام, ربات دیسکورد, طراحی با فیگما, جنگو, نود جی‌اس, وانیلا، ری‌اکت،"></meta>
            <link rel="canonical" href="https://localhost:3000"></link>
            <meta property="og:title" content="شرکت لوین | طراحی وب‌سایت، سئو، امنیت و ربات‌های تلگرام و دیسکورد"></meta>
            <meta property="og:description" content="شرکت لوین ارائه دهنده خدمات طراحی و توسعه وب‌سایت، سئو، امنیت و طراحی ربات‌های تلگرام و دیسکورد. با تیم حرفه‌ای ما وب‌سایت خود را به سطح بالاتری ببرید."></meta>
            <meta property="og:image" content="Images/Icon/favIcon.svg"></meta>
            <meta property="og:url" content="https://localhost:3000/"></meta>
      </Helmet>
 <h1 style={{display:"none"}}>لوین تیمSEO</h1> {/* This section should go to the external CSS file after SEO */}

    {/* Hero box => */}
    <div className='hero-box'>
        <div className='hero-box-text'>
            <h2>نینجا ها برای خدمت به شما آماده اند...</h2>
            <p>در لوین، با استفاده از جدیدترین روش‌های طراحی وب‌سایت، پروژه‌های منحصربه‌فردی خلق می‌کنیم. با ما همراه شوید تا تجربه‌ای حرفه‌ای و بی‌نظیر را در طراحی وب‌سایت به دست آورید.</p>
        <div>
            <Btn 
            text="استخدام نینجا" 
            backgroundColor="var(--primary)" 
            textColor="var(--bg-btn-color)"
            to={'/ContactUs'}
            onClick={scrollTop}
            />
        </div>
        </div>        

        <div className='levin-team'> <Levinteam/> </div>
    </div>

    {/* About Company => */}

    <div className='about-company'>
      <section>
        <div className='text-company'>
          <div className='heading-company'>
            {/* SVG ninja file for About Company => */}
          <svg width="160" height="55" viewBox="0 0 160 55" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect x="0.5" y="0.5" width="158.688" height="54.4893" rx="4" fill="var(--primary)"/>
          <ellipse cx="42.0192" cy="29.7447" rx="11.5831" ry="13.7546" fill="#121632"/>
          <ellipse cx="117.669" cy="29.7447" rx="11.5831" ry="13.7546" fill="#121632"/>
          </svg>

            <h6> به سایت خودت فکر کردی؟ </h6>
          </div>

          <h2> تیم درستی رو انتخاب کردی! </h2>
          <p>
          تیم لوین اینجاست تا به کارآفرین‌ها کمک کنه ایده‌هاشون رو به محصول تبدیل کنن و با موفقیت وارد بازار کنن. ما به شرکت‌هایی که در حال رشد هستن کمک می‌کنیم تا با پیدا کردن تیم‌های توسعه‌ی حرفه‌ای و آماده، کار ساخت و راه‌اندازی رو با سرعت و کیفیت شروع کنن. اگر شما هم دنبال یه تیم متخصص برای پیشبرد پروژه‌هاتون هستید، ما کنارتونیم!
          </p>
        </div>
      </section>
    </div>

{/* Card List =>  */}

    <PoPup show={showModal} data={foundData} onClose={toggleModal} />

    <div className='card-list'>
      <div className='card-animation'>
      <ul> 

        {/* Desctop */}
      {cardData.map((data) => (
        <li onClick={toggleModal} key={data.id} style={{background: 'none'}} value={data.id}> 
          <div className='card'>
              <div>
                <span className='model-name'>
                {data.name}  
                </span>
              <span> 
                {data.description} 
              </span>
            </div>
          </div>
        </li>
        ))}

      </ul>
    <div className='last-circle'></div>
	  <div className='second-circle'></div>
	  <div className='mask'></div>
	  </div>

      <div className='regular-card-animation'>
          <ul>
{/* Mobile */}
      {cardData.map((data) => (
        <li onClick={toggleModal} key={data.id}  value={data.id}>
          <div className='regular-card'>
              <div href={data.src}><span className='model-name'>
                {data.name}  </span>
              <span> {data.description} </span>
            </div>
          </div>
        </li>
        ))}
          </ul>
      </div>

	  <div className='center-circle'>
        {/* SVG ninja file for Cart List => */}
      <svg width="165" height="165" viewBox="0 0 314 314" fill="none" xmlns="http://www.w3.org/2000/svg">
      <rect x="223.16" y="7.91786" width="28.5954" height="75.8582" rx="14.2977" transform="rotate(8.28448 223.16 7.91786)" fill="var(--ninja)"/>
      <rect x="278.953" y="32.3466" width="28.5954" height="75.8582" rx="14.2977" transform="rotate(84.0476 278.953 32.3466)" fill="var(--ninja)"/>
      <circle cx="157" cy="157" r="136.183" transform="rotate(-9.31302 157 157)" fill="var(--ninja)" stroke="#818181"/>
      <rect x="48.5011" y="135.273" width="207.105" height="77.9942" rx="3.5" transform="rotate(-9.31302 48.5011 135.273)" fill="var(--primary)"/>
      <path d="M91.8673 183.121L89.9409 171.37C88.3237 161.505 95.0097 152.197 104.875 150.58V150.58C114.739 148.962 124.047 155.648 125.665 165.513L127.591 177.264" stroke="#121632" strokeWidth="16" strokeLinecap="round"/>
      <path d="M191.364 165.386L189.438 153.635C187.821 143.77 194.507 134.462 204.372 132.845V132.845C214.236 131.228 223.544 137.914 225.162 147.778L227.088 159.53" stroke="#121632" strokeWidth="16" strokeLinecap="round"/>
      </svg>
    </div>
      </div>


  {/* Smart Management => */}

    <div className='sm-container'>

      <section className='sm-textbox'>
        <h2> زمانت را هوشمندانه مدیریت کن! </h2>
        <h6> درآمدت را با بهره‌وری بیشتر افزایش بده. </h6>
        <ul>
          {smTextBox.map((textBox) => (
              <li className="sm-textbox-list" key={textBox.id}>
                <img src={textBox.src} />
                <p>{textBox.text}</p>
              </li>
          ))}
        </ul>
      </section>
      
      <figure className='sm-Baner'>
        <img src="Images/Baner/sm-Baner.svg" alt="" />
      </figure>

    </div>

{/* Call To Action */}

<section className='startDevelop'>
  <h2>با نینجاهای ماهر لوین همکاری کنید و تیم خود را تقویت کنید!</h2>
      <Btn 
      text={'شروع ماجراجویی'} 
      backgroundColor={'var(--primary)'}  
      textColor={'var(--bg-btn-color)'}
      to={'/AboutUs'} 
      onClick={scrollTop}
      />
    </section>

{/* Roadmap Card */}

  <div className='roadmap-container'>
      <div className='roadmap-top'>
        <svg width="636" height="111" viewBox="0 0 636 111" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M243 10.5562L197.993 55.5635L243 100.571" stroke="#8C4CF5" strokeWidth="10" strokeLinecap="round" strokeLinejoin="round"/>
          <g clipPath="url(#clip0_1138_1398)">
          <path d="M288.541 17.0104C291.487 15.9592 294.683 15.8265 297.706 16.6297C300.729 17.433 303.437 19.1345 305.473 21.5095C307.509 23.8845 308.776 26.8211 309.107 29.9315C309.439 33.0419 308.819 36.1797 307.329 38.9304L354.627 86.2329L348.382 92.478L301.08 45.1755C298.329 46.6591 295.192 47.2743 292.085 46.94C288.977 46.6057 286.043 45.3376 283.67 43.3029C281.297 41.2682 279.597 38.5623 278.792 35.5418C277.988 32.5213 278.118 29.3279 279.164 26.3826L289.044 36.2627C289.656 36.8954 290.387 37.4002 291.195 37.7474C292.003 38.0946 292.872 38.2773 293.752 38.285C294.632 38.2926 295.504 38.125 296.318 37.7919C297.133 37.4588 297.872 36.9668 298.494 36.3448C299.116 35.7228 299.608 34.9831 299.941 34.1689C300.274 33.3547 300.442 32.4823 300.434 31.6027C300.427 30.723 300.244 29.8537 299.897 29.0454C299.55 28.2371 299.045 27.5061 298.412 26.8949L288.536 17.006L288.541 17.0104ZM334.328 25.3314L348.382 17.5228L354.627 23.7679L346.819 37.8218L339.01 39.3853L329.647 48.753L323.397 42.5079L332.765 33.1401L334.328 25.3314ZM304.657 61.2478L310.902 67.4929L287.481 90.9145C286.685 91.7131 285.613 92.1768 284.486 92.2106C283.358 92.2443 282.261 91.8456 281.418 91.0961C280.575 90.3466 280.051 89.3031 279.953 88.1796C279.855 87.0561 280.191 85.9377 280.891 85.0536L281.236 84.6694L304.657 61.2478Z" fill="var(--text)"/>
          </g>
          <path d="M393 10.5562L438.007 55.5635L393 100.571" stroke="#8C4CF5" strokeWidth="10" strokeLinecap="round" strokeLinejoin="round"/>
          <defs>
          <clipPath id="clip0_1138_1398">
          <rect width="106" height="106" fill="white" transform="translate(265 2.56348)"/>
          </clipPath>
          </defs>
        </svg>
        <section>
          <h2> مسیر پیشرفت </h2>
        </section>
      </div>
      <div className='roadmap-bottom'>
        <section>
          {roadmap.map(name => (
            <div key={name.id} className='roadmap-cart'>
              <h3>{name.id}</h3>
              <h4>{name.title}</h4>
              <p>{name.content}</p>
            </div>
          ))}
        </section>
      </div>
  </div>

    </>
  )
}
