import React from 'react'
import './Privacy.css'

const Privacy = () => {

    const privacyCases = [
        {heading:' جمع‌آوری اطلاعات ' , paragraph:' در شرکت لوین، حفظ حریم خصوصی شما اولویت اصلی ماست. ما اطلاعاتی از قبیل نام، نام خانوادگی، شماره تلفن، و ایمیل شما را به منظور بهبود تجربه کاربری، شناسایی شما در هنگام ورود به سایت، و ارائه خدمات بهتر جمع‌آوری می‌کنیم. این اطلاعات به ما کمک می‌کنند تا خدمات خود را دقیق‌تر و کارآمدتر به شما ارائه دهیم. '},
        {heading:' استفاده از اطلاعات ' , paragraph:' اطلاعات شما به منظور بهبود خدمات، ایجاد تجربیات شخصی‌سازی‌شده، ارائه تبلیغات هدفمند و انجام تحلیل‌های مربوط به رفتار کاربری ذخیره و استفاده می‌شوند. ما از این اطلاعات برای اطمینان از ارائه بهترین خدمات و پیشنهادات به شما بهره می‌بریم. علاوه بر این، اطلاعات جمع‌آوری‌شده می‌توانند برای توسعه محصولات و خدمات جدید و بهبود فرآیندهای داخلی مورد استفاده قرار گیرند. '},
        {heading:' اشتراک‌گذاری اطلاعات ' , paragraph:' ما اطلاعات شخصی شما را تنها با رضایت شما و یا به منظور رعایت قوانین و مقررات مربوطه با اشخاص ثالث به اشتراک می‌گذاریم. این اشخاص ممکن است شامل شرکت‌های تبلیغاتی، تحلیل‌گران داده، یا شرکای تجاری ما باشند که به ما کمک می‌کنند تا خدمات بهتری به شما ارائه دهیم. هرگونه اشتراک‌گذاری اطلاعات با دقت و با رعایت کامل اصول امنیتی انجام می‌شود. '},
        {heading:' حقوق کاربران ' , paragraph:' شما حق دارید هر زمان که مایل باشید، درخواست حذف اکانت کاربری خود را مطرح کنید. برای این منظور می‌توانید با تیم پشتیبانی ما تماس بگیرید. همچنین، شما می‌توانید دسترسی به اطلاعات شخصی خود را درخواست کرده و یا اطلاعات خود را اصلاح کنید. '},
        {heading:' کوکی‌ها ' , paragraph:' ما از کوکی‌ها به منظور بهبود عملکرد سایت و ارائه تبلیغات هدفمند استفاده می‌کنیم. کوکی‌ها فایل‌های کوچکی هستند که در دستگاه شما ذخیره می‌شوند و به ما کمک می‌کنند تا ترجیحات شما را بشناسیم و خدمات بهتری ارائه دهیم. شما می‌توانید تنظیمات کوکی‌های خود را در مرورگر خود تغییر دهید، اما توجه داشته باشید که غیرفعال کردن کوکی‌ها ممکن است بر عملکرد سایت تأثیر بگذارد. '} ,
        // {heading:'' , paragraph:''}
    ]

    const securityCases = [
        {heading:' امنیت اطلاعات ' , paragraph:' شرکت لوین متعهد به حفاظت از اطلاعات شخصی شما است. ما از مجموعه‌ای از تکنولوژی‌های پیشرفته و پروتکل‌های امنیتی برای حفاظت از داده‌های شما استفاده می‌کنیم. پسوردهای شما به صورت رمزگذاری‌شده در سیستم‌های ما ذخیره می‌شوند و از الگوریتم‌های رمزگذاری قوی برای اطمینان از امنیت آنها استفاده می‌شود. علاوه بر این، فایروال‌های پیشرفته‌ای در سرورهای ما نصب شده‌اند تا از دسترسی غیرمجاز به داده‌های شما جلوگیری کنند. '},
        {heading:' تدابیر امنیتی اضافی ' , paragraph:' ما از نرم‌افزارهای آنتی‌ویروس و ابزارهای مانیتورینگ امنیتی برای شناسایی و جلوگیری از تهدیدات امنیتی استفاده می‌کنیم. تمامی انتقالات داده بین کاربر و سرورهای ما از طریق پروتکل‌های امن SSL انجام می‌شود که تضمین می‌کند اطلاعات شما در حین انتقال از دید هکرها محفوظ بماند. '},
        {heading:' اطلاع‌رسانی رخنه‌های امنیتی ' , paragraph:' در صورت بروز هرگونه رخنه امنیتی، ما به سرعت کاربران را از طریق ایمیل و سایر روش‌های ارتباطی مطلع خواهیم کرد. همچنین، تدابیر لازم برای کاهش اثرات رخنه و جلوگیری از رخدادهای مشابه در آینده اتخاذ خواهد شد. '},
        // {heading:'' , paragraph:''}
    ]

    return (
        <div className='privacy-container'>
            <div className='privacy-content'>
                <h2> حریم خصوصی </h2>
                {privacyCases.map((info , Index) => (
                    <div key={Index}>
                        <h5> {info.heading} </h5>
                        <p> {info.paragraph} </p>
                    </div>
                ))}
            </div>

            <div className='security-content'>
                <h2> امنیت </h2>
                {securityCases.map((info , Index) => (
                    <div key={Index}>
                        <h5> {info.heading} </h5>
                        <p> {info.paragraph} </p>
                    </div>
                ))}
            </div>
        </div>
    )
}

export default Privacy ;